let list = [
    [
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_135.jpg',
        'ЗНАК ОВЕН',
        'Овен — первый знак Зодиака, символизирующий активное проявление в мире. Символ знака — голова барана. Это символ наступательной мощи, стремления к жизни, инициативы и смелости. Овен — знак Огня, кардинальный. Управитель знака Овен — Марс. Экзальтация Солнца. Изгнание Венеры. Падение Сатурна.'
    ],
    [
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_140.jpg',
        'ЗНАК ТЕЛЕЦ',
        'Телец — второй знак Зодиака. Его символ — голова и рога быка. Это символ силы воли, упорства и развития. Телец — знак Земли, фиксированный. Управитель знака Телец — Венера. Экзальтация Луны. Изгнание Марса. Падение Урана.'
    ],
    [
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_129.jpg',
        'ЗНАК БЛИЗНЕЦЫ',
        'Близнецы — третий знак Зодиака. Его символ — два куска дерева, соединенные между собой. Это символ противоборствующих ментальных процессов, взаимопроникновения духа и материи, связь ритма и формы. Близнецы — знак Воздуха, мутабельный. Управитель знака Близнецы — Меркурий. Изгнание Юпитера.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_136.jpg',
        'ЗНАК ЗОДИАКА РАК',
        'Рак — четвертый знак Зодиака. Его символ — клешни краба, стремящиеся сомкнуться. Это символ слияния мужской и женской половых клеток, материнства, стремление к росту, развитию. Рак — знак Воды, кардинальный. Управитель знака Рак — Луна. Экзальтация Юпитера. Изгнание Сатурна. Падение Марса.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_134.jpg',
        'ЗНАК ЛЕВ',
        'Лев — пятый знак Зодиака. Его символ — сперматозоид. Это символ животворящей энергии, силы и удачи. Лев — знак Огня, фиксированный. Управитель знака Лев - Солнце. Экзальтация Плутона. Изгнание Урана. Падение Меркурия.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_132.jpg',
        'ЗНАК ДЕВА',
        'Дева — шестой знак Зодиака. Его символ — сноп колосьев. Это символизирует непорочность зачатия, человеческую добродетель, критичность, практичность, помощь. Дева — знак Земли, мутабельный. Управитель знака Дева — Меркурий. Экзальтация Меркурия. Изгнание Нептуна. Падение Венеры.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_130.jpg',
        'ЗНАК ВЕСЫ',
        'Весы — седьмой знак Зодиака. Его символ — две чаши весов. Это обозначает стремление к устойчивости, гармонии, осознанию высшего Закона мироздания, объективности суждений. Весы символизируют закат Солнца. Весы — знак Воздуха, кардинальный. Управитель знака Весы — Венера. Экзальтация Сатурна. Изгнание Марса. Падение Солнца.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_138.jpg',
        'ЗНАК ЗОДИАКА СКОРПИОН',
        'Скорпион — восьмой знак Зодиака. Его символ в разные эпохи по-разному понимался и изображался главным образом как скорпион, аспид, змея. В нашу эпоху этот символ изображается как скорпион: лапы и хвост, в котором находится жало. Скорпион — знак Воды, фиксированный. Управитель знака Зодиака Скорпион — Плутон. Экзальтация Урана. Изгнание Венеры. Падение Луны.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_140_2.jpg',
        'ЗНАК СТРЕЛЕЦ',
        'Стрелец — девятый знак Зодиака. Его символ — стрела и лук. Изображается главным образом в виде кентавра. Ключевые слова к раскрытию его символа: целеустремленность, энтузиазм, прогрессивность, щедрость. Стрелец — знак Огня, мутабельный. Управитель знака Стрелец — Юпитер. Экзальтация Хирона. Изгнание Меркурия.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_133.jpg',
        'ЗНАК КОЗЕРОГ',
        'Козерог — десятый знак Зодиака. Его символ — голова и передняя часть туловища козла, а задняя часть рыбья. Мифологически этот символ воплощает представления о тритонах, дельфинах, «морских козлах». Все это символизирует крайности высот и глубин, справедливость, сочетание индивидуального и общечеловеческого. Козерог — знак Земли, кардинальный. Управитель знака Козерог — Сатурн. Экзальтация Марса. Изгнание Луны. Падение Юпитера.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_131.jpg',
        'ЗНАК ВОДОЛЕЙ',
        'Водолей — одиннадцатый знак Зодиака. Его символ — две волны, которые обозначают «живую» и «мертвую» воду. Часто изображается в виде человека, выливающего из кувшина воду, что должно обозначать слугу человечества, стремящегося утолить жажду познания. Водолей - знак Воздуха, фиксированный. Управители знака Водолей — Уран и Сатурн. Экзальтация Меркурия. Изгнание Солнца. Падение Плутона.'
    ],
    [
        
        'https://www.kartinki24.ru/uploads/gallery/thumb/279/kartinki24_ru_zodiac_signs_137.jpg',
        'ЗНАК РЫБЫ',
        'Рыбы — двенадцатый знак Зодиака. Его символ — две рыбы, связанные хвостами, стремящиеся в разные стороны, скитаются в просторах океана. Это символизирует жизнь после смерти, борьбу души и тела, подавленность самовыражения. Рыбы — знак Воды, мутабельный. Управитель знака Рыбы — Нептун. Экзальтация Венеры. Изгнание и падение Меркурия.'
    ],
]

let day = +prompt("Enter day -> "),
    month = +prompt("Enter month -> "),
    year = +prompt("Enter year -> ")

if (isNaN(day) || isNaN(month) || isNaN(year) || day < 1 || day > 31 || month < 1 || month > 12 || year < 1)
{
    console.error("Error!!!")
}
else
{
    switch (true)
    {
        case day >= 21 && month == 3 || day <= 19 && month == 4:
            index = 0
            break
        case day >= 20 && month == 4 || day <= 20 && month == 5:
            index = 1
            break
        case day >= 21 && month == 5 || day <= 20 && month == 6:
            index = 2
            break
        case day >= 21 && month == 6 || day <= 22 && month == 7:
            index = 3
            break
        case day >= 23 && month == 7 || day <= 22 && month == 8:
            index = 4
            break
        case day >= 23 && month == 8 || day <= 22 && month == 9:
            index = 5
            break
        case day >= 23 && month == 9 || day <= 22 && month == 10:
            index = 6
            break
        case day >= 23 && month == 10 || day <= 21 && month == 11:
            index = 7
            break
        case day >= 22 && month == 11 || day <= 21 && month == 12:
            index = 8
            break
        case day >= 22 && month == 12 || day <= 19 && month == 1:
            index = 9
            break
        case day >= 20 && month == 1 || day <= 18 && month == 2:
            index = 10
            break
        case day >= 19 && month == 2 || day <= 20 && month == 3:
            index = 11
            break
    }
    
    let image = document.getElementById('image'),
        title = document.getElementById('title'),
        description = document.getElementById('description')

    image.src = list[index][0];
    title.textContent = list[index][1]
    description.textContent = list[index][2]
}
